import { Component } from '@angular/core';

@Component({
  selector: 'app-faq-block',
  templateUrl: './faq-block.component.html',
  styleUrls: ['./faq-block.component.scss'],
})
export class FaqBlockComponent {
  faqs = [
    {
      question: 'Як проходить онлайн-консультація?',
      answer:
        'Консультації проходять на любій зручний вам платформі. За годину перед консультацією з вами зв`яжеться лікар або наш менеджер',
    },
    {
      question: 'Наскільки ефективним є онлайн-прийом?',
      answer:
        'Онлайн-прийом є абсолютно таким самим ефективним, як і особистий візит. Психологу чи психіатру не потрібно проводити фізичний огляд пацієнта. Головне — мати можливість включити відео під час дзвінка.',
    },
    {
      question: 'Я боюсь іти до психолога/психіатра. Що мені робити?',
      answer:
        'Відчувати страх перед зверненням до психолога чи психіатра — це нормально. Наші спеціалісти ніколи не засуджують, завжди підтримують і ведуть відкритий діалог. Ви можете познайомитися з нами через Instagram або поставити запитання безкоштовно.',
    },

    {
      question: 'Хто мені потрібен: психолог чи психіатр?',
      answer:
        'Зверніться до психолога, якщо хочете працювати над тим, на що можете вплинути самостійно. Зверніться до психіатра, якщо маєте симптоми, на які важко вплинути самостійно.',
    },
    {
      question: 'Як ви виписуєте рецепт на ліки?',
      answer:
        'Якщо вашим курсом лікування передбачено ліки, лікар виписує рецепт.',
    },
  ];
}
